Octopus/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/Enums/МоделиТСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>МоделиТСД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Caribe_PL_40L</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Caribe_PL_45L</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Caribe_PL_55L</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LTP_83</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Newland_MT65_Beluga</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Newland_MT90</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Symbol_MC40</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sunmi_L2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Urovo_i6300</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Urovo_i6310</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Zebra_TC21</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУказана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучныеНастройки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Octopus/CommonForms/Настройки/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПроверитьПодключение(Команда)

	Если Модифицированность Тогда
		Записать();
	КонецЕсли;

	Попытка
		РезультатПроверки = Разработка.Пинг();
	Исключение
		ТехническоеОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	Если РезультатПроверки = Истина Тогда
		Сообщить("Перевірка підключення до бази успішно пройдена");
	Иначе
		Сообщить("Перевірка підключення до бази не пройдена.
		|Перевірте правильність введених даних для підключення, наявність інтернету на пристрої, а також публікацію основної бази на стороні сервера.
		|
		|Або зверніться по допомогу до технічного фахівця: " + ТехническоеОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЛокальнуюБазуДанных(Команда)

	ОписаниеОповещенияОчищения = Новый ОписаниеОповещения("ВопросОчиститьЛокальнуюБазуДанныхЗавершение", ЭтаФорма);
	ТекстВопроса = "Після виконання цієї процедури всі дані мобільної бази 1С на пристрої буде видалено. Продовжити?";
	ПоказатьВопрос(ОписаниеОповещенияОчищения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , , "Видалення");

КонецПроцедуры

&НаКлиенте
Процедура ВопросОчиститьЛокальнуюБазуДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Разработка.ОчиститьЛокальнуюБазуДанныхНаУстройстве();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ВыполненаНачальнаяИнициализация" Тогда
		Прочитать();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МодельТСДПриИзменении(Элемент)

	МодельТСДПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура МодельТСДПриИзмененииНаСервере()

	УстановитьДоступность();
	Если НаборКонстант.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.РучныеНастройки") Тогда
		Возврат;
	КонецЕсли;

	Если НаборКонстант.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Caribe_PL_45L")
		ИЛИ НаборКонстант.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Caribe_PL_40L") Тогда
			ИмяСобытияСканирования = "scan.rcv.message";
			ИмяПоляШтрихкода = "barocode";
	ИначеЕсли НаборКонстант.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Caribe_PL_55L") Тогда
		ИмяСобытияСканирования = "com.action.SCAN_RESULT";
		ИмяПоляШтрихкода = "scanContext";
	ИначеЕсли НаборКонстант.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Urovo_i6300")
		ИЛИ НаборКонстант.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Urovo_i6310") Тогда
			ИмяСобытияСканирования = "android.intent.ACTION_DECODE_DATA";
			ИмяПоляШтрихкода = "barcode_string";
	ИначеЕсли НаборКонстант.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Newland_MT65_Beluga")
		ИЛИ НаборКонстант.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Newland_MT90") Тогда
			ИмяСобытияСканирования = "nlscan.action.SCANNER_RESULT";
			ИмяПоляШтрихкода = "SCAN_BARCODE1";
	ИначеЕсли НаборКонстант.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Zebra_TC21") Тогда
		//глКомпонента.УстановитьПараметр("Category", "android.intent.category.DEFAULT");
		ИмяСобытияСканирования = "com.iksoftware.zebra.SCAN";
		ИмяПоляШтрихкода = "com.symbol.datawedge.data_string";
	ИначеЕсли НаборКонстант.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Symbol_MC40") Тогда
		//глКомпонента.УстановитьПараметр("Category", "android.intent.category.DEFAULT");
		ИмяСобытияСканирования = "com.symbol.datawedge.DWDEMO";
		ИмяПоляШтрихкода = "com.symbol.datawedge.data_string";
	ИначеЕсли НаборКонстант.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.LTP_83") Тогда
		ИмяСобытияСканирования = "scan.rcv.message";
		ИмяПоляШтрихкода = "barocode";
	ИначеЕсли НаборКонстант.МодельТСД = ПредопределенноеЗначение("Перечисление.МоделиТСД.Sunmi_L2") Тогда
		ИмяСобытияСканирования = "com.sunmi.scanner.ACTION_DATA_CODE_RECEIVED";
		ИмяПоляШтрихкода = "data";
	КонецЕсли;

	НаборКонстант.ИмяСобытияСканирования = ИмяСобытияСканирования;
	НаборКонстант.ИмяПоляШтрихкода = ИмяПоляШтрихкода;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьДоступность();

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()

	РедактироватьНастройкиСканирования = (НаборКонстант.МодельТСД = Перечисления.МоделиТСД.РучныеНастройки);
	Элементы.ИмяСобытияСканирования.РедактированиеТекста = РедактироватьНастройкиСканирования;
	Элементы.ИмяПоляШтрихкода.РедактированиеТекста = РедактироватьНастройкиСканирования;

КонецПроцедуры

//Лицензирование NovashIV
&НаКлиенте
Процедура ПроксиПолучить(Команда)
	ЛицензированиеСервер.УстановитьСоединение();
КонецПроцедуры

&НаКлиенте
Процедура СтатусЛицензииПолучить(Команда)
	СтатусЛицензии = ЛицензированиеСервер.СтатусЛицензии(НаборКонстант.ИдентификаторУстройства,НаборКонстант.Доступно_Лицензии,НаборКонстант.ДатаОкончанияЛицензии);
	Элементы.НадписьДоступностьЛицензии.Заголовок = СтатусЛицензии.Заголовок;
	Элементы.НадписьДоступностьЛицензии.ЦветТекста = СтатусЛицензии.ЦветТекста;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЛицензию(Команда)
	Ответ = ЛицензированиеСервер.ПроверитьЛицензию(НаборКонстант.ИдентификаторУстройства);
	
	НаборКонстант.Доступно_Лицензии     = Ответ.Доступно;
	НаборКонстант.ДатаОкончанияЛицензии = Ответ.ДатаОкончанияЛицензии;
	НаборКонстант.ДатаПолученияЛицензии = Ответ.ДатаДосупа;
	
	Элементы.НадписьДоступностьЛицензии.Заголовок = Ответ.СтатусЛицензии.Заголовок;
	Элементы.НадписьДоступностьЛицензии.ЦветТекста = Ответ.СтатусЛицензии.ЦветТекста;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеПоЛицензииВсеДанные(Команда)
	Если ЗначениеЗаполнено(НаборКонстант.ИдентификаторУстройства) Тогда 
		Ответ = ЛицензированиеСервер.ПроверитьЛицензиюВсе(НаборКонстант.ИдентификаторУстройства);
		
		Если Ответ.НетПрокси Тогда 
			Сообщить("Не вдалося встановити WS-з'єднання із сервером ліцензування. Перевірте підключення до інтернету");
			
			
		ИначеЕсли Ответ.ОшибкаПолучениеДанныхПоЛицензии Тогда 			
			Сообщить("Помилка отримання даних за ліцензією.");
		Иначе
			НаборКонстант.Доступно_Лицензии      = Ответ.Доступно;
			НаборКонстант.ДатаОкончанияЛицензии  = Ответ.ДатаОкончанияЛицензии;
			
			НаборКонстант.ДатаПолученияЛицензии  = Ответ.ДатаПолученияЛицензии;	
			НаборКонстант.Имя_Лицензии           = Ответ.Имя_Лицензии;
			НаборКонстант.Телефон_Лицензии       = Ответ.Телефон_Лицензии;
			НаборКонстант.EMail_Лицензии         = Ответ.EMail_Лицензии;
			НаборКонстант.Комментарий_Лицензии   = Ответ.Комментарий_Лицензии;
			
			
			Элементы.НадписьДоступностьЛицензии.Заголовок = Ответ.СтатусЛицензии.Заголовок;
			Элементы.НадписьДоступностьЛицензии.ЦветТекста = Ответ.СтатусЛицензии.ЦветТекста;

			Сообщить("Дані за ліцензією отримано");
		КонецЕсли;
		
	Иначе
		Сообщить("Не заповнено ідентифікатор пристрою! Проведіть початкову ініціалізацію!");
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСсылкаНаСайтНажатие(Элемент, СтандартнаяОбработка)
	Попытка
		ЗапуститьПриложение("https://vrgroup.info/");
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НаборКонстант.ЛицензияЗарегистрированна Тогда 
		Элементы.ЗарегистрироватьЛицензию.Видимость = Ложь;
		
		Элементы.Имя_Лицензии.ТолькоПросмотр         = Истина;
		Элементы.Телефон_Лицензии.ТолькоПросмотр     = Истина;
		Элементы.EMail_Лицензии.ТолькоПросмотр       = Истина;
		Элементы.Комментарий_Лицензии.ТолькоПросмотр = Истина;
		
	ИначеЕсли НаборКонстант.ЛицензияЗарегистрированна = Ложь Тогда 
		Элементы.ЗарегистрироватьЛицензию.Видимость = Истина;
		
		Элементы.Имя_Лицензии.ТолькоПросмотр         = Ложь;
		Элементы.Телефон_Лицензии.ТолькоПросмотр     = Ложь;
		Элементы.EMail_Лицензии.ТолькоПросмотр       = Ложь;
		Элементы.Комментарий_Лицензии.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
	Элементы.НадписьДоступностьЛицензии.Заголовок = НаборКонстант.НадписьДоступностьЛицензии;
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьЛицензию(Команда)
	Если ЗначениеЗаполнено(НаборКонстант.ИдентификаторУстройства) Тогда 
		Если НаборКонстант.ЛицензияЗарегистрированна Тогда 
			Элементы.ЗарегистрироватьЛицензию.Видимость = Ложь;
			
			Элементы.Имя_Лицензии.ТолькоПросмотр         = Истина;
			Элементы.Телефон_Лицензии.ТолькоПросмотр     = Истина;
			Элементы.EMail_Лицензии.ТолькоПросмотр       = Истина;
			Элементы.Комментарий_Лицензии.ТолькоПросмотр = Истина;
			
		ИначеЕсли НаборКонстант.ЛицензияЗарегистрированна = Ложь Тогда 
			ЭтаФорма.Модифицированность = Истина;
			НаборКонстант.ЛицензияЗарегистрированна = ЛицензированиеСервер.ЗарегистрироватьЛицензиюОтправитьДанныеНаСервер(НаборКонстант.ИдентификаторУстройства,НаборКонстант.Имя_Лицензии,НаборКонстант.Телефон_Лицензии,НаборКонстант.EMail_Лицензии,НаборКонстант.Комментарий_Лицензии);
			
			Если НаборКонстант.ЛицензияЗарегистрированна Тогда 
				
				Элементы.ЗарегистрироватьЛицензию.Видимость = Ложь;
				
				Элементы.Имя_Лицензии.ТолькоПросмотр         = Ложь;
				Элементы.Телефон_Лицензии.ТолькоПросмотр     = Ложь;
				Элементы.EMail_Лицензии.ТолькоПросмотр       = Ложь;
				Элементы.Комментарий_Лицензии.ТолькоПросмотр = Ложь;
				
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Сообщить("Не заповнено Ідентифікатор пристрою! Проведіть початкову ініціалізацію та зареєструйте ліцензію!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтатьиЗатратНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиЗатрат.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСправочников = РезультатЗапроса.Выбрать();	
	
	Пока ВыборкаСправочников.Следующий() Цикл
		СправочникОбъект = ВыборкаСправочников.Ссылка.ПолучитьОбъект();
		Если СправочникОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СправочникОбъект.Удалить();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтатьиЗатрат(Команда)
	УдалитьСтатьиЗатратНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменФото(Команда)
	//+NovashIV_19.02.2023
	ПроцедурыОбменаДанными.ОтправкаФотоПриОбмене();
	//-NovashIV_19.02.2023
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменДанными(Команда)
	ОбменУспешноВыполнен = Разработка.ВыполнитьОбменДанными();
	Если ОбменУспешноВыполнен Тогда
		ТекстОповещения = "Обмін даними виконано";
		КартинкаОповещения = БиблиотекаКартинок.Успешно;
	Иначе
		ТекстОповещения = "Обмін даними не виконано";
		КартинкаОповещения = БиблиотекаКартинок.Ошибка;
	КонецЕсли;
	ПоказатьОповещениеПользователя(ТекстОповещения, , ТекущаяДата(), КартинкаОповещения);
	
	//+NovashIV_19.02.2023
	ПроцедурыОбменаДанными.ОтправкаФотоПриОбмене();
	//-NovashIV_19.02.2023
	Оповестить("ВыполненОбменДанными");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьШтрикода(Команда)
	
	Сообщить(ПроверитьШтрикодаСервер());
	
КонецПроцедуры

&НаСервере
Функция ПроверитьШтрикодаСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Владелец КАК Владелец,
	|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Штрихкоды.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Штрихкоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат Строка(ВыборкаДетальныеЗаписи.Количество());
	
КонецФункции

&НаСервере
Процедура ОчиститьШтрихкодыНаСервере()
	НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей(); 
	НаборЗаписей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьШтрихкоды(Команда)
	ОчиститьШтрихкодыНаСервере();
	Сообщить("Штрихкоды очищены!");
КонецПроцедуры

&НаКлиенте
Процедура ПроритьСерии(Команда)
	
	Серия = ПроверитьСерию();
	Сообщить(Серия);
	//Сообщить);
КонецПроцедуры

&НаСервере
Функция ПроверитьСерию()
	
	 Константы.ИспользоватьСерииНоменклатуры.Установить(Истина);
	
	Возврат  Константы.ИспользоватьСерииНоменклатуры.Получить();
	
КонецФункции

&НаСервере
Функция  ПроверитьНоменклатуруНаСервере()
	СтруктураВозврата = Новый Структура;
	Телотруктура = Новый Структура;
	
	МассивГуидов = Новый Массив;
	
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураНоменлктары = Новый Структура;
		СтруктураНоменлктары.Вставить("guid",XMLСтрока(ВыборкаДетальныеЗаписи.Ссылка));
		МассивГуидов.Добавить(СтруктураНоменлктары);
	КонецЦикла;
	
	Телотруктура.Вставить("products",МассивГуидов);
	Телотруктура.Вставить("node_code",ПланыОбмена.vrgМобильныеСклад.ЭтотУзел().Код);
	
	ЗаписьJSON  = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Телотруктура);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	HTTPСоединение = Новый HTTPСоединение("31.134.113.57", 80, "ryslanyakovlev_1", "7338108");                                 
	//HTTPЗапрос = Новый HTTPЗапрос("Test_Vechir_1c_prog/en_US/hs/api/app-version/" + Параметры);
	HTTPЗапрос = Новый HTTPЗапрос("Test_Vechir_1c_prog/en_US/hs/api/CheckProduct/");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
	//HTTPЗапрос = Новый HTTPЗапрос("1C_Xatanet/en_US/hs/api/app-version/" + Параметры);
	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);         
	
	СтрокаJson = Ответ.ПолучитьТелоКакСтроку();
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(СтрокаJson);  
	Данные = ПрочитатьJSON(ЧтениеJson);
	//Сообщить(СтрокаJson); 
	
	
	
	
	
	Если Данные.succeses Тогда 
		
		ОбменУспешноВыполнен = Разработка.ВыполнитьОбменДанными(); 
		Если ОбменУспешноВыполнен Тогда
			
		СтруктураВозврата.Вставить("Успех",Истина);
		СтруктураВозврата.Вставить("Описание","Номенклатура успешно обновлена");
			
		Иначе
		СтруктураВозврата.Вставить("Успех",Ложь);
		СтруктураВозврата.Вставить("Описание","Не удалось выполнить обмен номенклатурой");	
			
		КонецЕсли
		
	Иначе
		СтруктураВозврата.Вставить("Успех",Ложь);
		СтруктураВозврата.Вставить("Описание","Не удалось загрузить номенклатура");
		
	КонецЕсли;
	
	Возврат СтруктураВозврата
	КонецФункции 

&НаКлиенте
Процедура ПроверитьНоменклатуру(Команда)
	
	
	ТекстВопроса = "Процедура оновлення номенклатури може зайняти тривалий час. Продовжити?";
	ОписаниеОповещенияВопроса = Новый ОписаниеОповещения("ОтветНаВопросЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещенияВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , , "Ціни");
	
		
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		СтруктураУспеха = ПроверитьНоменклатуруНаСервере(); 
	
		Сообщить(СтруктураУспеха.Описание);

	КонецЕсли;

КонецПроцедуры
